{
    "sections": [
        {
            "title": "What do these terms and conditions do",
            "paragraphs": [
                "These Terms and Conditions grant you the non-exclusive, non-transferable, revocable right to use the Slipstream Racing app in accordance with these Terms and Conditions.",
            ]
        },
        {
            "title": "In-App Purchases",
            "paragraphs": [
                "Any fees or charges charged by us for use of the Slipstream Racing app are stated in the order process of the relevant application store for the application or made clear before the point of the in-app purchase. However, you may incur data charges from your carrier or other provider for downloading and/or using the Slipstream app."
            ]
        },
        {
            "title": "Limitations on use",
            "paragraphs": [
                "You may download the Slipstream Racing app though the Apple App Store on such for your personal and non-commercial purposes only. You are not permitted either yourself, or through by way of assistance from any third party, to distribute, copy, extract or commercially exploit the Slipstream Racing app."
            ]
        },
        {
            "title": "Updates",
            "paragraphs": [
                "From time to time we may update any Slipstream Racing app to improve performance, enhance functionality, reflect changes to the way the app works or address security issues. Alternatively we may ask you to update the relevant Slipstream Racing app for these reasons. If you choose not to install such updates or if you opt-out of automatic updates you may not be able to continue using the Slipstream app and you will be responsible for any loss or damage you may suffer by continuing to use an outdated version of the Slipstream app."
            ]
        },
        {
            "title": "Our liability",
            "paragraphs": [
                "To the extent permitted by law, we shall not be liable in contract, tort, negligence, breach of statutory duty, or otherwise for any loss or damage whatsoever in any way connected with your use or inability to use the Slipstream app, or your use or reliance on any in the app."
            ]
        },
        {
            "title": "Availability",
            "paragraphs": [
                "We do not guarantee that the Slipstream app, or any content thereon, will always be available or be uninterrupted. We may suspend or withdraw or restrict the availability of all or any part of the app for business and operational reasons (including maintenance, updates, technical improvements or to develop its content and/or presentation)."
            ]
        }
    ]
}
