[{"title": "Verstappen beats Leclerc in thrilling duel in Saudi Arabia ", "date": "27/03/22", "text": "Max Verstappen took his first victory of the 2022 FIA Formula One World thanks to a late overtaking move past Ferrari’s Charles Leclerc in a nail-biting finish to the Saudi Arabian Grand Prix. Carlos Sainz took third place for Ferrari, while position position man and early race leader Sergio Pérez was forced to settle for fourth after he was disadvantaged by a safety car period just after his first pit stop."}, {"title": "Pérez claims first F1 pole position in Saudi Arabia ahead of Leclerc and Sainz", "date": "26/03/22", "text": "Red Bull Racing’s Sergio Pérez claimed his first career pole position at the Jeddah Corniche Circuit, beating Ferrari’s Charles Leclerc by two hundredths of a second to claim top spot in qualifying for the Saudi Arabian Grand Prix. Carlos Sainz was third for Ferrari while defending world champion Max Verstappen will line up fourth for tomorrow’s race."}, {"title": "FIA Statement: Incident during Qualifying, 2022 FIA Formula 1 Saudi Arabian Grand Prix ", "date": "26/03/22", "text": "The FIA advises that an incident occurred during Qualifying for the 2022 FIA Formula 1 Saudi Arabian Grand Prix today, 26/03/22, involving car #47, Mick Schumacher. Assessment at the Medical Centre revealed no injuries, and he has been transferred to King Fahad Armed Forces Hospital, Jeddah, for precautionary checks."}, {"title": "Leclerc quickest in final practice at Jeddah Corniche Circuit ahead of Red Bulls", "date": "26/03/22", "text": "Ferrari’s Charles Leclerc beat the Red Bulls of Max Verstappen and Sergio Pérez to take top spot in the final practice session for the 2022 FIA Formula 1 Saudi Arabian Grand Prix. The Monegasque driver set a best time of 1:29.735 nudge defending world champion Verstappen out of P1 by just 0.033s."}, {"title": "Leclerc continues to set the pace in delayed second practice for Saudi Arabian Grand Prix", "date": "25/03/22", "text": "Charles Leclerc repeated his timesheet-topping efforts of FP1 by setting the fastest lap of the second practice session for this weekend’s FIA Formula 1 Saudi Arabian Grand Prix, beating world champion Max Verstappen by a little over a tenth of a second. However, the Ferrari driver did not take part in the latter stages of the session following a brush with the walls at the Jeddah Corniche Circuit."}, {"title": "Leclerc tops first free practice session for Saudi Arabian Grand Prix", "date": "25/03/22", "text": "Ferrari's Charles Leclerc beat Max Verstappen to go quickest in the opening free practice session for the 2022 FIA Formula 1 Saudia Arabian Grand Prix in Jeddah."}, {"title": "FIA Women in Motorsport Commission member, Aseel Al Hamad, behind the wheel of an F1 car (BWT Alpine F1 team) in Saudi Arabia", "date": "24/03/22", "text": "BWT Alpine F1 Team press release, 24th March 2022"}, {"title": "Leclerc leads Ferrari 1-2 in Bahrain ahead of Hamilton as Red Bull fail to finish", "date": "20/03/22", "text": "Race winner Charles Leclerc and team-mate Carlos Sainz gave Ferrari the perfect start to the 2022 FIA Formula One World Championship by delivering the Scuderia’s first one-two finish in almost three years at the season-opening Bahrain Grand Prix."}, {"title": "Leclerc claims pole position for season-opening Bahrain Grand Prix ahead of Verstappen, Sainz", "date": "19/03/22", "text": "Charles Leclerc claimed the tenth pole position of his career as Ferrari roared to the top of the pecking order in Formula 1’s new era. Defending world champion Max Verstappen will line up alongside the Monegasque on the front row, while Carlos Sainz claimed third place for Scuderia ahead of the second Red Bull of Sergio Pérez. Seven-time champion Lewis Hamilton will start from fourth place."}, {"title": "Max Verstappen beats Charles Leclerc, Sergio Pérez in final practice in Bahrain", "date": "19/03/22", "text": "Red Bull Racing’s Max Verstappen wen quickest in the final practice session ahead of qualifying for the Bahrain Grand Prix beating Ferrari's Charles Leclerc to by less than a tenth of a second with Sergio Pérez third in the second Red Bull RB18."}]
